app/controllers/school_classes_controller.rb

  def update
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-04-08 23:35:11.564610"], ["id", 1]]